In [3]:
from bs4 import BeautifulSoup
import requests
import pandas as pd

In [4]:

url='https://en.wikipedia.org/wiki/List_of_largest_companies_in_the_United_States_by_revenue'
page=requests.get(url)
soup=BeautifulSoup(page.text,'html')

In [5]:
#soup

In [6]:
#finding the first table

#soup.find_all('table')[1]

In [7]:
table1=soup.find_all('table')[1]

In [8]:
table1.find_all('th')

[<th>Rank
 </th>,
 <th>Name
 </th>,
 <th>Industry
 </th>,
 <th>Revenue <br/>(USD millions)
 </th>,
 <th>Revenue growth
 </th>,
 <th>Employees
 </th>,
 <th>Headquarters
 </th>]

In [9]:
#finding titles in table1
titles1=table1.find_all('th')

In [10]:
t1=[t.text.strip() for t in titles1]

In [11]:
t1

['Rank',
 'Name',
 'Industry',
 'Revenue (USD millions)',
 'Revenue growth',
 'Employees',
 'Headquarters']

In [12]:
#creating a dataframe using titles as columns

df1=pd.DataFrame(columns=t1)

In [13]:
df1

Empty DataFrame
Columns: [Rank, Name, Industry, Revenue (USD millions), Revenue growth, Employees, Headquarters]
Index: []

In [14]:
len(df1)

0

In [16]:
#finding rows
#table1.find_all('tr')

In [17]:
column_data1=table1.find_all('tr')

In [18]:
#adding row data to the df2

for row in column_data1[1:]:
    row_data=row.find_all('td')
    row=[data.text.strip() for data in row_data]
    length=len(df1)
    df1.loc[length]=row

In [19]:
row

['100',
 'Qualcomm',
 'Technology',
 '44,200',
 '31.7%',
 '51,000',
 'San Diego, California']

In [20]:
df1

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,ExxonMobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,"394,328",7.8%,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,"324,162",12.7%,"400,000","Minnetonka, Minnesota"
...,...,...,...,...,...,...,...
95,96,Best Buy,Retail,"46,298",10.6%,"71,100","Richfield, Minnesota"
96,97,Bristol-Myers Squibb,Pharmaceutical industry,"46,159",0.5%,"34,300","New York City, New York"
97,98,United Airlines,Airline,"44,955",82.5%,"92,795","Chicago, Illinois"
98,99,Thermo Fisher Scientific,Laboratory instruments,"44,915",14.5%,"130,000","Waltham, Massachusetts"
99,100,Qualcomm,Technology,"44,200",31.7%,"51,000","San Diego, California"

In [21]:
#finding table2
table2=soup.find_all('table')[2]

In [22]:
#table2

In [23]:
#finding titles for table2
title2=table2.find_all('th')

In [24]:
t2=[t.text.split() for t in title2]

In [25]:
t2

[['Rank'],
 ['Name'],
 ['Industry'],
 ['Revenue', '(USD', 'billions)'],
 ['Employees'],
 ['Headquarters']]

In [26]:
t2[3]=['Revenue']

In [27]:
t2

[['Rank'],
 ['Name'],
 ['Industry'],
 ['Revenue'],
 ['Employees'],
 ['Headquarters']]

In [28]:
t2x = []
[t2x.extend(sublist) for sublist in t2]
t2x

['Rank', 'Name', 'Industry', 'Revenue', 'Employees', 'Headquarters']

In [29]:
#creating a dataframe using titles as columns

df2=pd.DataFrame(columns=t2x)

In [30]:
df2

Empty DataFrame
Columns: [Rank, Name, Industry, Revenue, Employees, Headquarters]
Index: []

In [31]:
column_data2=table2.find_all('tr')

In [32]:
#adding row data to df2
for row in column_data2[1:]:
    row_data=row.find_all('td')
    row=[data.text.strip() for data in row_data] 
    length=len(df2)
    df2.loc[length]=row

In [33]:
df2

,Rank,Name,Industry,Revenue,Employees,Headquarters
0,1,Cargill,Food industry,165,"155,000","Minnetonka, Minnesota"
1,2,Koch Industries,Conglomerate,125,"120,000","Wichita, Kansas"
2,3,Publix Super Markets,Retail,48,"230,000","Winter Haven, Florida"
3,4,"Mars, Incorporated",Food industry,45,"140,000","McLean, Virginia"
4,5,Pilot Corporation,Petroleum industry and Retail,41.9,"30,000","Knoxville, Tennessee"
5,6,H-E-B,Retail,38.9,"145,000","San Antonio, Texas"
6,7,Reyes Holdings,Wholesaling,35.3,"33,000","Rosemont, Illinois"
7,8,C&S Wholesale Grocers,Wholesaling,33,"14,000","Keene, New Hampshire"
8,9,Enterprise Holdings,Car rental,30,"80,000","Clayton, Missouri"
9,10,Love's,Petroleum industry and Retail,25.5,"38,000","Oklahoma City, Oklahoma"

In [35]:
#creating CSV Files using tables

df1.to_csv(r'C:\Users\asuna\Downloads\scraped\wikit1.csv',index=False)
df2.to_csv(r'C:\Users\asuna\Downloads\scraped\wikit2.csv',index=False)